# Evaluate Method

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilterNumericLessOrEqual..::..Evaluate Method
FilterNumericLessOrEqual Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Evaluate(Int32, Int32) | **Obsolete.** Derived classes should override this method to implement the desired test.  (Inherited from FilterNumericRuleEvaluator.) |
| Evaluate(Int64, Int64) | Derived classes should override this method to implement the desired test.  (Inherited from FilterNumericRuleEvaluator.) |
| Evaluate(Double, Double, Double) | Derived classes override this method to implement the test that determines whether the two given double-precision values satisfy the desired condition or not.  (Inherited from FilterNumericRuleEvaluator.) |

# See Also
FilterNumericLessOrEqual Class
FilterNumericLessOrEqual Members
Autodesk.Revit.DB Namespace